{
  "item.sword_soaring.sword_soaring_secret": "Swordsmanship Secrets",
  "tip.sword_soaring.learn": "You've learned someone's secrets, now you can fly with your sword!",
  "tip.sword_soaring.spirit_value": "Spirit Value : %d",
  "tip.sword_soaring.stamina_consume": "Stamina consume : %s / tick",
  "skill.sword_soaring.sword_soaring": "Sword Soaring",
  "skill.sword_soaring.sword_soaring.tooltip": "Hold down the space to fly on the sword, release the space to stop. Consume stamina. Protect the next falling damage. Enchantment 'Enhance Sword Soaring Stamina' can reduce stamina consume.",
  "skill.sword_soaring.rain_screen": "Rain Screen",
  "skill.sword_soaring.rain_screen.tooltip": "Right-click to kick away the surrounding enemies and summon 4 swords around for 10 seconds. The sword screen can guard against all attacks. Each attack breaks one sword, consumes 2 stamina and heals the owner. The sword screen can only be summoned when there is no sword around and you have at least 6 stamina.",
  "skill.sword_soaring.rain_cutter": "Rain Cutter",
  "skill.sword_soaring.rain_cutter.tooltip": "Within 10 seconds after executing weapon innate, a basic attack or air attack will summon three swords to track and hurt your target. If the target is null, the sword will fly straight ahead.\n\nThe Fire Aspect Enchantment still works, but the duration of fire is reduced.",
  "skill.sword_soaring.yaksha_mask": "Yaksha's Mask",
  "skill.sword_soaring.yaksha_mask.tooltip": "Within 10 seconds after executing weapon innate, you gain the ability to perform a high jump, enabling the use of §l§4Meteor Slam Plus§r.\n\n§l§4Meteor Slam Plus§r : If your depression angle are less than 40 degrees while airborne, it will automatically adjust to 90 degrees. This removes the limitation based on weapon type but imposes a cap on jump height. Each attack consumes 1.5 stamina.",
  "skill.sword_soaring.stellar_restoration": "Stellar Restoration",
  "skill.sword_soaring.stellar_restoration.tooltip": "",
  "config.sword_soaring.fly_speed_scale": "the ratio of flying speed to view vector",
  "config.sword_soaring.stamina_consume_per_tick": "the stamina consumed per tick when flying",
  "config.sword_soaring.max_anticipation_tick": "ticks of pre taking off",
  "enchantment.sword_soaring.sword_soaring": "Enhance Sword Soaring Stamina"
}